/* automatically generated by rust-bindgen */

/// A pointer to a QVariant
pub type DosQVariant = ::std::os::raw::c_void;
/// A pointer to a QModelIndex
pub type DosQModelIndex = ::std::os::raw::c_void;
/// A pointer to a QAbstractItemModel
pub type DosQAbstractItemModel = ::std::os::raw::c_void;
/// A pointer to a QAbstractListModel
pub type DosQAbstractListModel = ::std::os::raw::c_void;
/// A pointer to a QAbstractTableModel
pub type DosQAbstractTableModel = ::std::os::raw::c_void;
/// A pointer to a QQmlApplicationEngine
pub type DosQQmlApplicationEngine = ::std::os::raw::c_void;
/// A pointer to a QQuickView
pub type DosQQuickView = ::std::os::raw::c_void;
/// A pointer to a QQmlContext
pub type DosQQmlContext = ::std::os::raw::c_void;
/// A pointer to a QHash<int,QByteArray>
pub type DosQHashIntQByteArray = ::std::os::raw::c_void;
/// A pointer to a QUrl
pub type DosQUrl = ::std::os::raw::c_void;
/// A pointer to a QMetaObject
pub type DosQMetaObject = ::std::os::raw::c_void;
/// A pointer to a QObject
pub type DosQObject = ::std::os::raw::c_void;
/// A pointer to a QQuickImageProvider
pub type DosQQuickImageProvider = ::std::os::raw::c_void;
/// A pointer to a QPixmap
pub type DosPixmap = ::std::os::raw::c_void;
/// A pixmap callback to be supplied to an image provider
/// \param id Image source id
/// \param width pointer to the width of the image
/// \param height pointer to the height of the image
/// \param requestedHeight sourceSize.height attribute

/// * from QML is QML that expect to free the memory for it thus it shouldn't be destroyed by the QObject in the binded language.
/// *
/// * An example of implementation in pseudocode is: \n
/// * \code{.nim}
/// proc createCallback(.....) =
/// # Call the constructor for the given type and create a QObject in Nim
/// let nimQObject = constructorMap[id]()
///
/// # Disable GC
/// GC.ref(nimQObject)
///
/// # Retrieve the DosQObject created dos_qobject_create() inside the nimQObject
/// *dosQObject = nimQObject.vptr
///
/// # Store the pointer to the nimQObject
/// *bindedQObject = cast[ptr](&nimQObject)
///
/// # Swap the vptr inside the nimQObject with the wrapper
/// nimQObject.vptr = wrapper
///
/// # The QObject in the Nim language should not destroy its inner DosQObject
/// nimQObject.owner = false
///
/// \endcode
///
/// * \param id This is the id for which we are requesting the creation.
/// * This is the same value that was returned during registration through the calls
/// * to dos_qdeclarative_qmlregistertype() or dos_qdeclarative_qmlregistersingletontype()
/// * \param wrapper This is the QObject wrapper that should be stored by the binded language and to which forward the
/// * DOtherSide calls
/// * \param bindedQObject This should be deferenced and assigned with the pointer of the QObject modeled in the binded language
/// * \param dosQObject This should be deferenced and assigned with the DosQObject pointer you gained from calling the dos_qobject_create() function
/// */
pub type CreateDObject = ::std::option::Option<
    unsafe extern "C" fn(
        id: ::std::os::raw::c_int,
        wrapper: *mut ::std::os::raw::c_void,
        bindedQObject: *mut *mut ::std::os::raw::c_void,
        dosQObject: *mut *mut ::std::os::raw::c_void,
    ),
>;
/// Callback invoked from QML for deleting a registered type
/// **
/// * This is called when the wrapper gets deleted from QML. The implementation should unref/unpin
/// * the \p bindedQObject or delete it in the case of languages without GC
/// * \param id This is the type id for which we are requesting the deletion
/// * \param bindedQObject This is the pointer you given in the CreateDObject callback and you can use it
/// * for obtaining the QObject in your binded language. This allows you to unpin/unref it or delete it.
/// */
pub type DeleteDObject = ::std::option::Option<
    unsafe extern "C" fn(id: ::std::os::raw::c_int, bindedQObject: *mut ::std::os::raw::c_void),
>;
/// \brief Store an array of QVariant
/// \note This struct should be freed by calling dos_qvariantarray_delete(DosQVariantArray *ptr). This in turn
/// cleans up the internal array
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DosQVariantArray {
    /// The number of elements
    pub size: ::std::os::raw::c_int,
    /// The array
    pub data: *mut *mut DosQVariant,
}
#[test]
fn bindgen_test_layout_DosQVariantArray() {
    assert_eq!(
        ::std::mem::size_of::<DosQVariantArray>(),
        16usize,
        concat!("Size of: ", stringify!(DosQVariantArray))
    );
    assert_eq!(
        ::std::mem::align_of::<DosQVariantArray>(),
        8usize,
        concat!("Alignment of ", stringify!(DosQVariantArray))
    );
}
/// The data needed for registering a custom type in the QML environment
/// **
/// * This is used from dos_qdeclarative_qmlregistertype() and dos_qdeclarative_qmlregistersingletontype() calls.
/// * \see dos_qdeclarative_qmlregistertype()
/// * \see dos_qdeclarative_qmlregistersingletontype()
/// * \note All string and objects are considered to be owned by the caller thus they'll
/// * not be freed
/// */
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct QmlRegisterType {
    /// The Module major version
    pub major: ::std::os::raw::c_int,
    /// The Module minor version
    pub minor: ::std::os::raw::c_int,
    /// The Module uri
    pub uri: *const ::std::os::raw::c_char,
    /// The type name to be used in QML files
    pub qml: *const ::std::os::raw::c_char,
    /// The type QMetaObject
    pub staticMetaObject: *mut DosQMetaObject,
    /// The callback invoked from QML when this type should be created
    pub createDObject: CreateDObject,
    /// The callback invoked from QML when this type should be deleted
    pub deleteDObject: DeleteDObject,
}
#[test]
fn bindgen_test_layout_QmlRegisterType() {
    assert_eq!(
        ::std::mem::size_of::<QmlRegisterType>(),
        48usize,
        concat!("Size of: ", stringify!(QmlRegisterType))
    );
    assert_eq!(
        ::std::mem::align_of::<QmlRegisterType>(),
        8usize,
        concat!("Alignment of ", stringify!(QmlRegisterType))
    );
}
/// Represents a parameter definition
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ParameterDefinition {
    /// The parameter name
    pub name: *const ::std::os::raw::c_char,
    /// The parameter metatype
    pub metaType: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ParameterDefinition() {
    assert_eq!(
        ::std::mem::size_of::<ParameterDefinition>(),
        16usize,
        concat!("Size of: ", stringify!(ParameterDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<ParameterDefinition>(),
        8usize,
        concat!("Alignment of ", stringify!(ParameterDefinition))
    );
}
/// Represents a single signal definition
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SignalDefinition {
    /// The signal name
    pub name: *const ::std::os::raw::c_char,
    /// The parameters count
    pub parametersCount: ::std::os::raw::c_int,
    /// The parameters
    pub parameters: *mut ParameterDefinition,
}
#[test]
fn bindgen_test_layout_SignalDefinition() {
    assert_eq!(
        ::std::mem::size_of::<SignalDefinition>(),
        24usize,
        concat!("Size of: ", stringify!(SignalDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<SignalDefinition>(),
        8usize,
        concat!("Alignment of ", stringify!(SignalDefinition))
    );
}
/// Represents a set of signal definitions
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SignalDefinitions {
    /// The total number of signals
    pub count: ::std::os::raw::c_int,
    /// The signals
    pub definitions: *mut SignalDefinition,
}
#[test]
fn bindgen_test_layout_SignalDefinitions() {
    assert_eq!(
        ::std::mem::size_of::<SignalDefinitions>(),
        16usize,
        concat!("Size of: ", stringify!(SignalDefinitions))
    );
    assert_eq!(
        ::std::mem::align_of::<SignalDefinitions>(),
        8usize,
        concat!("Alignment of ", stringify!(SignalDefinitions))
    );
}
/// Represents a single slot definition
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SlotDefinition {
    /// The slot name
    pub name: *const ::std::os::raw::c_char,
    /// The slot return type
    pub returnMetaType: ::std::os::raw::c_int,
    /// The parameters count
    pub parametersCount: ::std::os::raw::c_int,
    /// The parameters
    pub parameters: *mut ParameterDefinition,
}
#[test]
fn bindgen_test_layout_SlotDefinition() {
    assert_eq!(
        ::std::mem::size_of::<SlotDefinition>(),
        24usize,
        concat!("Size of: ", stringify!(SlotDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<SlotDefinition>(),
        8usize,
        concat!("Alignment of ", stringify!(SlotDefinition))
    );
}
/// Represents a set of slot definitions
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SlotDefinitions {
    /// The total number of slots
    pub count: ::std::os::raw::c_int,
    /// The slot definitions array
    pub definitions: *mut SlotDefinition,
}
#[test]
fn bindgen_test_layout_SlotDefinitions() {
    assert_eq!(
        ::std::mem::size_of::<SlotDefinitions>(),
        16usize,
        concat!("Size of: ", stringify!(SlotDefinitions))
    );
    assert_eq!(
        ::std::mem::align_of::<SlotDefinitions>(),
        8usize,
        concat!("Alignment of ", stringify!(SlotDefinitions))
    );
}
/// Represents a single property definition
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PropertyDefinition {
    /// The property name
    pub name: *const ::std::os::raw::c_char,
    /// The property metatype
    pub propertyMetaType: ::std::os::raw::c_int,
    /// The name of the property read slot
    pub readSlot: *const ::std::os::raw::c_char,
    /// \brief The name of the property write slot
    /// /// \note Setting this to null means a readonly proeperty
    pub writeSlot: *const ::std::os::raw::c_char,
    /// \brief The name of the property notify signals
    /// /// \note Setting this to null means a constant property
    pub notifySignal: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_PropertyDefinition() {
    assert_eq!(
        ::std::mem::size_of::<PropertyDefinition>(),
        40usize,
        concat!("Size of: ", stringify!(PropertyDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<PropertyDefinition>(),
        8usize,
        concat!("Alignment of ", stringify!(PropertyDefinition))
    );
}
/// Represents a set of property definitions
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PropertyDefinitions {
    /// The total number of properties
    pub count: ::std::os::raw::c_int,
    /// The property definitions array
    pub definitions: *mut PropertyDefinition,
}
#[test]
fn bindgen_test_layout_PropertyDefinitions() {
    assert_eq!(
        ::std::mem::size_of::<PropertyDefinitions>(),
        16usize,
        concat!("Size of: ", stringify!(PropertyDefinitions))
    );
    assert_eq!(
        ::std::mem::align_of::<PropertyDefinitions>(),
        8usize,
        concat!("Alignment of ", stringify!(PropertyDefinitions))
    );
}
/// Incapsulate all the QAbstractItemModel callbacks
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DosQAbstractItemModelCallbacks {
    pub rowCount: RowCountCallback,
    pub columnCount: ColumnCountCallback,
    pub data: DataCallback,
    pub setData: SetDataCallback,
    pub roleNames: RoleNamesCallback,
    pub flags: FlagsCallback,
    pub headerData: HeaderDataCallback,
    pub index: IndexCallback,
    pub parent: ParentCallback,
    pub hasChildren: HasChildrenCallback,
    pub canFetchMore: CanFetchMoreCallback,
    pub fetchMore: FetchMoreCallback,
}
#[test]
fn bindgen_test_layout_DosQAbstractItemModelCallbacks() {
    assert_eq!(
        ::std::mem::size_of::<DosQAbstractItemModelCallbacks>(),
        96usize,
        concat!("Size of: ", stringify!(DosQAbstractItemModelCallbacks))
    );
    assert_eq!(
        ::std::mem::align_of::<DosQAbstractItemModelCallbacks>(),
        8usize,
        concat!("Alignment of ", stringify!(DosQAbstractItemModelCallbacks))
    );
}
extern "C" {
    /// \brief Return the QCore::applicationDirPath
    /// \return The QCore::applicationDirPath as a UTF-8 string
    /// \note The returned string should be deleted by the calling code by using
    /// the dos_chararray_delete() function
    #[link_name = "\u{1}_Z41dos_qcoreapplication_application_dir_path"]
    pub fn dos_qcoreapplication_application_dir_path() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    /// \brief Create a QGuiApplication
    /// \note The created QGuiApplication should be freed by calling dos_qguiapplication_delete()
    #[link_name = "\u{1}_Z26dos_qguiapplication_create"]
    pub fn dos_qguiapplication_create();
}
extern "C" {
    /// \brief Calls the QGuiApplication::exec() function of the current QGuiApplication
    /// \note A QGuiApplication should have been already created through dos_qguiapplication_create()
    #[link_name = "\u{1}_Z24dos_qguiapplication_exec"]
